Model: "model_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_8 (InputLayer)         [(None, 14, 18, 6)]       0         
_________________________________________________________________
conv2d_102 (Conv2D)          (None, 7, 9, 64)          6208      
_________________________________________________________________
leaky_re_lu (LeakyReLU)      (None, 7, 9, 64)          0         
_________________________________________________________________
conv2d_103 (Conv2D)          (None, 4, 5, 128)         131200    
_________________________________________________________________
instance_normalization_106 ( (None, 4, 5, 128)         256       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 4, 5, 128)         0         
_________________________________________________________________
conv2d_104 (Conv2D)          (None, 4, 5, 256)         524544    
_________________________________________________________________
instance_normalization_107 ( (None, 4, 5, 256)         512       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 4, 5, 256)         0         
_________________________________________________________________
conv2d_105 (Conv2D)          (None, 4, 5, 512)         2097664   
_________________________________________________________________
instance_normalization_108 ( (None, 4, 5, 512)         1024      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 4, 5, 512)         0         
_________________________________________________________________
conv2d_106 (Conv2D)          (None, 4, 5, 512)         4194816   
_________________________________________________________________
instance_normalization_109 ( (None, 4, 5, 512)         1024      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 4, 5, 512)         0         
_________________________________________________________________
conv2d_107 (Conv2D)          (None, 4, 5, 1)           8193      
_________________________________________________________________
activation_68 (Activation)   (None, 4, 5, 1)           0         
=================================================================
Total params: 6,965,441
Trainable params: 6,965,441
Non-trainable params: 0
_________________________________________________________________
