Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_5 (InputLayer)            [(None, 14, 18, 6)]  0                                            
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 14, 18, 64)   24640       input_5[0][0]                    
__________________________________________________________________________________________________
instance_normalization_49 (Inst (None, 14, 18, 64)   128         conv2d_48[0][0]                  
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 14, 18, 64)   0           instance_normalization_49[0][0]  
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 14, 18, 128)  73856       activation_31[0][0]              
__________________________________________________________________________________________________
instance_normalization_50 (Inst (None, 14, 18, 128)  256         conv2d_49[0][0]                  
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 14, 18, 128)  0           instance_normalization_50[0][0]  
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 7, 9, 256)    295168      activation_32[0][0]              
__________________________________________________________________________________________________
instance_normalization_51 (Inst (None, 7, 9, 256)    512         conv2d_50[0][0]                  
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 7, 9, 256)    0           instance_normalization_51[0][0]  
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 7, 9, 256)    590080      activation_33[0][0]              
__________________________________________________________________________________________________
instance_normalization_52 (Inst (None, 7, 9, 256)    512         conv2d_51[0][0]                  
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 7, 9, 256)    0           instance_normalization_52[0][0]  
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 7, 9, 256)    590080      activation_34[0][0]              
__________________________________________________________________________________________________
instance_normalization_53 (Inst (None, 7, 9, 256)    512         conv2d_52[0][0]                  
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, 7, 9, 512)    0           instance_normalization_53[0][0]  
                                                                 activation_33[0][0]              
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 7, 9, 256)    1179904     concatenate_18[0][0]             
__________________________________________________________________________________________________
instance_normalization_54 (Inst (None, 7, 9, 256)    512         conv2d_53[0][0]                  
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 7, 9, 256)    0           instance_normalization_54[0][0]  
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 7, 9, 256)    590080      activation_35[0][0]              
__________________________________________________________________________________________________
instance_normalization_55 (Inst (None, 7, 9, 256)    512         conv2d_54[0][0]                  
__________________________________________________________________________________________________
concatenate_19 (Concatenate)    (None, 7, 9, 768)    0           instance_normalization_55[0][0]  
                                                                 concatenate_18[0][0]             
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 7, 9, 256)    1769728     concatenate_19[0][0]             
__________________________________________________________________________________________________
instance_normalization_56 (Inst (None, 7, 9, 256)    512         conv2d_55[0][0]                  
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 7, 9, 256)    0           instance_normalization_56[0][0]  
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 7, 9, 256)    590080      activation_36[0][0]              
__________________________________________________________________________________________________
instance_normalization_57 (Inst (None, 7, 9, 256)    512         conv2d_56[0][0]                  
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, 7, 9, 1024)   0           instance_normalization_57[0][0]  
                                                                 concatenate_19[0][0]             
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 7, 9, 256)    2359552     concatenate_20[0][0]             
__________________________________________________________________________________________________
instance_normalization_58 (Inst (None, 7, 9, 256)    512         conv2d_57[0][0]                  
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 7, 9, 256)    0           instance_normalization_58[0][0]  
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 7, 9, 256)    590080      activation_37[0][0]              
__________________________________________________________________________________________________
instance_normalization_59 (Inst (None, 7, 9, 256)    512         conv2d_58[0][0]                  
__________________________________________________________________________________________________
concatenate_21 (Concatenate)    (None, 7, 9, 1280)   0           instance_normalization_59[0][0]  
                                                                 concatenate_20[0][0]             
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 7, 9, 256)    2949376     concatenate_21[0][0]             
__________________________________________________________________________________________________
instance_normalization_60 (Inst (None, 7, 9, 256)    512         conv2d_59[0][0]                  
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 7, 9, 256)    0           instance_normalization_60[0][0]  
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 7, 9, 256)    590080      activation_38[0][0]              
__________________________________________________________________________________________________
instance_normalization_61 (Inst (None, 7, 9, 256)    512         conv2d_60[0][0]                  
__________________________________________________________________________________________________
concatenate_22 (Concatenate)    (None, 7, 9, 1536)   0           instance_normalization_61[0][0]  
                                                                 concatenate_21[0][0]             
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 7, 9, 256)    3539200     concatenate_22[0][0]             
__________________________________________________________________________________________________
instance_normalization_62 (Inst (None, 7, 9, 256)    512         conv2d_61[0][0]                  
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 7, 9, 256)    0           instance_normalization_62[0][0]  
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 7, 9, 256)    590080      activation_39[0][0]              
__________________________________________________________________________________________________
instance_normalization_63 (Inst (None, 7, 9, 256)    512         conv2d_62[0][0]                  
__________________________________________________________________________________________________
concatenate_23 (Concatenate)    (None, 7, 9, 1792)   0           instance_normalization_63[0][0]  
                                                                 concatenate_22[0][0]             
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 7, 9, 256)    4129024     concatenate_23[0][0]             
__________________________________________________________________________________________________
instance_normalization_64 (Inst (None, 7, 9, 256)    512         conv2d_63[0][0]                  
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 7, 9, 256)    0           instance_normalization_64[0][0]  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 7, 9, 256)    590080      activation_40[0][0]              
__________________________________________________________________________________________________
instance_normalization_65 (Inst (None, 7, 9, 256)    512         conv2d_64[0][0]                  
__________________________________________________________________________________________________
concatenate_24 (Concatenate)    (None, 7, 9, 2048)   0           instance_normalization_65[0][0]  
                                                                 concatenate_23[0][0]             
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 7, 9, 256)    4718848     concatenate_24[0][0]             
__________________________________________________________________________________________________
instance_normalization_66 (Inst (None, 7, 9, 256)    512         conv2d_65[0][0]                  
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 7, 9, 256)    0           instance_normalization_66[0][0]  
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 7, 9, 256)    590080      activation_41[0][0]              
__________________________________________________________________________________________________
instance_normalization_67 (Inst (None, 7, 9, 256)    512         conv2d_66[0][0]                  
__________________________________________________________________________________________________
concatenate_25 (Concatenate)    (None, 7, 9, 2304)   0           instance_normalization_67[0][0]  
                                                                 concatenate_24[0][0]             
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 7, 9, 256)    5308672     concatenate_25[0][0]             
__________________________________________________________________________________________________
instance_normalization_68 (Inst (None, 7, 9, 256)    512         conv2d_67[0][0]                  
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 7, 9, 256)    0           instance_normalization_68[0][0]  
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 7, 9, 256)    590080      activation_42[0][0]              
__________________________________________________________________________________________________
instance_normalization_69 (Inst (None, 7, 9, 256)    512         conv2d_68[0][0]                  
__________________________________________________________________________________________________
concatenate_26 (Concatenate)    (None, 7, 9, 2560)   0           instance_normalization_69[0][0]  
                                                                 concatenate_25[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 14, 18, 128)  2949248     concatenate_26[0][0]             
__________________________________________________________________________________________________
instance_normalization_70 (Inst (None, 14, 18, 128)  256         conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 14, 18, 128)  0           instance_normalization_70[0][0]  
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 14, 18, 64)   73792       activation_43[0][0]              
__________________________________________________________________________________________________
instance_normalization_71 (Inst (None, 14, 18, 64)   128         conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 14, 18, 64)   0           instance_normalization_71[0][0]  
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 14, 18, 6)    24582       activation_44[0][0]              
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 14, 18, 6)    42          conv2d_69[0][0]                  
==================================================================================================
Total params: 35,306,928
Trainable params: 35,306,928
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "model_4"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            [(None, 14, 18, 6)]  0                                            
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 14, 18, 64)   24640       input_7[0][0]                    
__________________________________________________________________________________________________
instance_normalization_83 (Inst (None, 14, 18, 64)   128         conv2d_80[0][0]                  
__________________________________________________________________________________________________
activation_53 (Activation)      (None, 14, 18, 64)   0           instance_normalization_83[0][0]  
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 14, 18, 128)  73856       activation_53[0][0]              
__________________________________________________________________________________________________
instance_normalization_84 (Inst (None, 14, 18, 128)  256         conv2d_81[0][0]                  
__________________________________________________________________________________________________
activation_54 (Activation)      (None, 14, 18, 128)  0           instance_normalization_84[0][0]  
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 7, 9, 256)    295168      activation_54[0][0]              
__________________________________________________________________________________________________
instance_normalization_85 (Inst (None, 7, 9, 256)    512         conv2d_82[0][0]                  
__________________________________________________________________________________________________
activation_55 (Activation)      (None, 7, 9, 256)    0           instance_normalization_85[0][0]  
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 7, 9, 256)    590080      activation_55[0][0]              
__________________________________________________________________________________________________
instance_normalization_86 (Inst (None, 7, 9, 256)    512         conv2d_83[0][0]                  
__________________________________________________________________________________________________
activation_56 (Activation)      (None, 7, 9, 256)    0           instance_normalization_86[0][0]  
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 7, 9, 256)    590080      activation_56[0][0]              
__________________________________________________________________________________________________
instance_normalization_87 (Inst (None, 7, 9, 256)    512         conv2d_84[0][0]                  
__________________________________________________________________________________________________
concatenate_30 (Concatenate)    (None, 7, 9, 512)    0           instance_normalization_87[0][0]  
                                                                 activation_55[0][0]              
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 7, 9, 256)    1179904     concatenate_30[0][0]             
__________________________________________________________________________________________________
instance_normalization_88 (Inst (None, 7, 9, 256)    512         conv2d_85[0][0]                  
__________________________________________________________________________________________________
activation_57 (Activation)      (None, 7, 9, 256)    0           instance_normalization_88[0][0]  
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 7, 9, 256)    590080      activation_57[0][0]              
__________________________________________________________________________________________________
instance_normalization_89 (Inst (None, 7, 9, 256)    512         conv2d_86[0][0]                  
__________________________________________________________________________________________________
concatenate_31 (Concatenate)    (None, 7, 9, 768)    0           instance_normalization_89[0][0]  
                                                                 concatenate_30[0][0]             
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 7, 9, 256)    1769728     concatenate_31[0][0]             
__________________________________________________________________________________________________
instance_normalization_90 (Inst (None, 7, 9, 256)    512         conv2d_87[0][0]                  
__________________________________________________________________________________________________
activation_58 (Activation)      (None, 7, 9, 256)    0           instance_normalization_90[0][0]  
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 7, 9, 256)    590080      activation_58[0][0]              
__________________________________________________________________________________________________
instance_normalization_91 (Inst (None, 7, 9, 256)    512         conv2d_88[0][0]                  
__________________________________________________________________________________________________
concatenate_32 (Concatenate)    (None, 7, 9, 1024)   0           instance_normalization_91[0][0]  
                                                                 concatenate_31[0][0]             
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 7, 9, 256)    2359552     concatenate_32[0][0]             
__________________________________________________________________________________________________
instance_normalization_92 (Inst (None, 7, 9, 256)    512         conv2d_89[0][0]                  
__________________________________________________________________________________________________
activation_59 (Activation)      (None, 7, 9, 256)    0           instance_normalization_92[0][0]  
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 7, 9, 256)    590080      activation_59[0][0]              
__________________________________________________________________________________________________
instance_normalization_93 (Inst (None, 7, 9, 256)    512         conv2d_90[0][0]                  
__________________________________________________________________________________________________
concatenate_33 (Concatenate)    (None, 7, 9, 1280)   0           instance_normalization_93[0][0]  
                                                                 concatenate_32[0][0]             
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 7, 9, 256)    2949376     concatenate_33[0][0]             
__________________________________________________________________________________________________
instance_normalization_94 (Inst (None, 7, 9, 256)    512         conv2d_91[0][0]                  
__________________________________________________________________________________________________
activation_60 (Activation)      (None, 7, 9, 256)    0           instance_normalization_94[0][0]  
__________________________________________________________________________________________________
conv2d_92 (Conv2D)              (None, 7, 9, 256)    590080      activation_60[0][0]              
__________________________________________________________________________________________________
instance_normalization_95 (Inst (None, 7, 9, 256)    512         conv2d_92[0][0]                  
__________________________________________________________________________________________________
concatenate_34 (Concatenate)    (None, 7, 9, 1536)   0           instance_normalization_95[0][0]  
                                                                 concatenate_33[0][0]             
__________________________________________________________________________________________________
conv2d_93 (Conv2D)              (None, 7, 9, 256)    3539200     concatenate_34[0][0]             
__________________________________________________________________________________________________
instance_normalization_96 (Inst (None, 7, 9, 256)    512         conv2d_93[0][0]                  
__________________________________________________________________________________________________
activation_61 (Activation)      (None, 7, 9, 256)    0           instance_normalization_96[0][0]  
__________________________________________________________________________________________________
conv2d_94 (Conv2D)              (None, 7, 9, 256)    590080      activation_61[0][0]              
__________________________________________________________________________________________________
instance_normalization_97 (Inst (None, 7, 9, 256)    512         conv2d_94[0][0]                  
__________________________________________________________________________________________________
concatenate_35 (Concatenate)    (None, 7, 9, 1792)   0           instance_normalization_97[0][0]  
                                                                 concatenate_34[0][0]             
__________________________________________________________________________________________________
conv2d_95 (Conv2D)              (None, 7, 9, 256)    4129024     concatenate_35[0][0]             
__________________________________________________________________________________________________
instance_normalization_98 (Inst (None, 7, 9, 256)    512         conv2d_95[0][0]                  
__________________________________________________________________________________________________
activation_62 (Activation)      (None, 7, 9, 256)    0           instance_normalization_98[0][0]  
__________________________________________________________________________________________________
conv2d_96 (Conv2D)              (None, 7, 9, 256)    590080      activation_62[0][0]              
__________________________________________________________________________________________________
instance_normalization_99 (Inst (None, 7, 9, 256)    512         conv2d_96[0][0]                  
__________________________________________________________________________________________________
concatenate_36 (Concatenate)    (None, 7, 9, 2048)   0           instance_normalization_99[0][0]  
                                                                 concatenate_35[0][0]             
__________________________________________________________________________________________________
conv2d_97 (Conv2D)              (None, 7, 9, 256)    4718848     concatenate_36[0][0]             
__________________________________________________________________________________________________
instance_normalization_100 (Ins (None, 7, 9, 256)    512         conv2d_97[0][0]                  
__________________________________________________________________________________________________
activation_63 (Activation)      (None, 7, 9, 256)    0           instance_normalization_100[0][0] 
__________________________________________________________________________________________________
conv2d_98 (Conv2D)              (None, 7, 9, 256)    590080      activation_63[0][0]              
__________________________________________________________________________________________________
instance_normalization_101 (Ins (None, 7, 9, 256)    512         conv2d_98[0][0]                  
__________________________________________________________________________________________________
concatenate_37 (Concatenate)    (None, 7, 9, 2304)   0           instance_normalization_101[0][0] 
                                                                 concatenate_36[0][0]             
__________________________________________________________________________________________________
conv2d_99 (Conv2D)              (None, 7, 9, 256)    5308672     concatenate_37[0][0]             
__________________________________________________________________________________________________
instance_normalization_102 (Ins (None, 7, 9, 256)    512         conv2d_99[0][0]                  
__________________________________________________________________________________________________
activation_64 (Activation)      (None, 7, 9, 256)    0           instance_normalization_102[0][0] 
__________________________________________________________________________________________________
conv2d_100 (Conv2D)             (None, 7, 9, 256)    590080      activation_64[0][0]              
__________________________________________________________________________________________________
instance_normalization_103 (Ins (None, 7, 9, 256)    512         conv2d_100[0][0]                 
__________________________________________________________________________________________________
concatenate_38 (Concatenate)    (None, 7, 9, 2560)   0           instance_normalization_103[0][0] 
                                                                 concatenate_37[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 14, 18, 128)  2949248     concatenate_38[0][0]             
__________________________________________________________________________________________________
instance_normalization_104 (Ins (None, 14, 18, 128)  256         conv2d_transpose_8[0][0]         
__________________________________________________________________________________________________
activation_65 (Activation)      (None, 14, 18, 128)  0           instance_normalization_104[0][0] 
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 14, 18, 64)   73792       activation_65[0][0]              
__________________________________________________________________________________________________
instance_normalization_105 (Ins (None, 14, 18, 64)   128         conv2d_transpose_9[0][0]         
__________________________________________________________________________________________________
activation_66 (Activation)      (None, 14, 18, 64)   0           instance_normalization_105[0][0] 
__________________________________________________________________________________________________
conv2d_101 (Conv2D)             (None, 14, 18, 6)    24582       activation_66[0][0]              
__________________________________________________________________________________________________
activation_67 (Activation)      (None, 14, 18, 6)    0           conv2d_101[0][0]                 
==================================================================================================
Total params: 35,306,886
Trainable params: 35,306,886
Non-trainable params: 0
__________________________________________________________________________________________________
