Model: "model_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_9 (InputLayer)         [(None, 112, 144, 1)]     0         
_________________________________________________________________
conv2d_108 (Conv2D)          (None, 112, 144, 16)      160       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 56, 72, 16)        0         
_________________________________________________________________
conv2d_109 (Conv2D)          (None, 56, 72, 8)         1160      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 28, 36, 8)         0         
_________________________________________________________________
conv2d_110 (Conv2D)          (None, 28, 36, 6)         438       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 14, 18, 6)         0         
_________________________________________________________________
activation_69 (Activation)   (None, 14, 18, 6)         0         
=================================================================
Total params: 1,758
Trainable params: 1,758
Non-trainable params: 0
_________________________________________________________________
