Model: "model_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_10 (InputLayer)        [(None, 112, 144, 1)]     0         
_________________________________________________________________
conv2d_111 (Conv2D)          (None, 112, 144, 16)      160       
_________________________________________________________________
dense_4 (Dense)              (None, 112, 144, 16)      272       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 56, 72, 16)        0         
_________________________________________________________________
conv2d_112 (Conv2D)          (None, 56, 72, 8)         1160      
_________________________________________________________________
dense_5 (Dense)              (None, 56, 72, 8)         72        
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 28, 36, 8)         0         
_________________________________________________________________
conv2d_113 (Conv2D)          (None, 28, 36, 6)         438       
_________________________________________________________________
dense_6 (Dense)              (None, 28, 36, 6)         42        
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 14, 18, 6)         0         
_________________________________________________________________
dense_7 (Dense)              (None, 14, 18, 6)         42        
=================================================================
Total params: 2,186
Trainable params: 2,186
Non-trainable params: 0
_________________________________________________________________
