Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 14, 18, 6)]  0                                            
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 14, 18, 6)]  0                                            
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 14, 18, 6)]  0                                            
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 14, 18, 6)]  0                                            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 14, 18, 24)   0           input_1[0][0]                    
                                                                 input_2[0][0]                    
                                                                 input_3[0][0]                    
                                                                 input_4[0][0]                    
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 14, 18, 64)   98368       concatenate[0][0]                
__________________________________________________________________________________________________
instance_normalization (Instanc (None, 14, 18, 64)   128         conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 14, 18, 64)   0           instance_normalization[0][0]     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 14, 18, 128)  73856       activation[0][0]                 
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 14, 18, 128)  256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 14, 18, 128)  0           instance_normalization_1[0][0]   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 9, 256)    295168      activation_1[0][0]               
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 7, 9, 256)    512         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 7, 9, 256)    0           instance_normalization_2[0][0]   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 7, 9, 256)    590080      activation_2[0][0]               
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 7, 9, 256)    512         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 7, 9, 256)    0           instance_normalization_3[0][0]   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 9, 256)    590080      activation_3[0][0]               
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 7, 9, 256)    512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 7, 9, 512)    0           instance_normalization_4[0][0]   
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 9, 256)    1179904     concatenate_1[0][0]              
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 7, 9, 256)    512         conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 7, 9, 256)    0           instance_normalization_5[0][0]   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 7, 9, 256)    590080      activation_4[0][0]               
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 7, 9, 256)    512         conv2d_6[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 7, 9, 768)    0           instance_normalization_6[0][0]   
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 7, 9, 256)    1769728     concatenate_2[0][0]              
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 7, 9, 256)    512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 7, 9, 256)    0           instance_normalization_7[0][0]   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 7, 9, 256)    590080      activation_5[0][0]               
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 7, 9, 256)    512         conv2d_8[0][0]                   
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 7, 9, 1024)   0           instance_normalization_8[0][0]   
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 14, 18, 128)  1179776     concatenate_3[0][0]              
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 14, 18, 128)  256         conv2d_transpose[0][0]           
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 14, 18, 128)  0           instance_normalization_9[0][0]   
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 14, 18, 64)   73792       activation_6[0][0]               
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 14, 18, 64)   128         conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 14, 18, 64)   0           instance_normalization_10[0][0]  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 14, 18, 6)    24582       activation_7[0][0]               
__________________________________________________________________________________________________
dense (Dense)                   (None, 14, 18, 6)    42          conv2d_9[0][0]                   
==================================================================================================
Total params: 7,059,888
Trainable params: 0
Non-trainable params: 7,059,888
__________________________________________________________________________________________________
