Model: "model_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 14, 18, 6)]  0                                            
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 14, 18, 64)   24640       input_6[0][0]                    
__________________________________________________________________________________________________
instance_normalization_72 (Inst (None, 14, 18, 64)   128         conv2d_70[0][0]                  
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 14, 18, 64)   0           instance_normalization_72[0][0]  
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 14, 18, 128)  73856       activation_45[0][0]              
__________________________________________________________________________________________________
instance_normalization_73 (Inst (None, 14, 18, 128)  256         conv2d_71[0][0]                  
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 14, 18, 128)  0           instance_normalization_73[0][0]  
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 7, 9, 256)    295168      activation_46[0][0]              
__________________________________________________________________________________________________
instance_normalization_74 (Inst (None, 7, 9, 256)    512         conv2d_72[0][0]                  
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 7, 9, 256)    0           instance_normalization_74[0][0]  
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 7, 9, 256)    590080      activation_47[0][0]              
__________________________________________________________________________________________________
instance_normalization_75 (Inst (None, 7, 9, 256)    512         conv2d_73[0][0]                  
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 7, 9, 256)    0           instance_normalization_75[0][0]  
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 7, 9, 256)    590080      activation_48[0][0]              
__________________________________________________________________________________________________
instance_normalization_76 (Inst (None, 7, 9, 256)    512         conv2d_74[0][0]                  
__________________________________________________________________________________________________
concatenate_27 (Concatenate)    (None, 7, 9, 512)    0           instance_normalization_76[0][0]  
                                                                 activation_47[0][0]              
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 7, 9, 256)    1179904     concatenate_27[0][0]             
__________________________________________________________________________________________________
instance_normalization_77 (Inst (None, 7, 9, 256)    512         conv2d_75[0][0]                  
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 7, 9, 256)    0           instance_normalization_77[0][0]  
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 7, 9, 256)    590080      activation_49[0][0]              
__________________________________________________________________________________________________
instance_normalization_78 (Inst (None, 7, 9, 256)    512         conv2d_76[0][0]                  
__________________________________________________________________________________________________
concatenate_28 (Concatenate)    (None, 7, 9, 768)    0           instance_normalization_78[0][0]  
                                                                 concatenate_27[0][0]             
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 7, 9, 256)    1769728     concatenate_28[0][0]             
__________________________________________________________________________________________________
instance_normalization_79 (Inst (None, 7, 9, 256)    512         conv2d_77[0][0]                  
__________________________________________________________________________________________________
activation_50 (Activation)      (None, 7, 9, 256)    0           instance_normalization_79[0][0]  
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 7, 9, 256)    590080      activation_50[0][0]              
__________________________________________________________________________________________________
instance_normalization_80 (Inst (None, 7, 9, 256)    512         conv2d_78[0][0]                  
__________________________________________________________________________________________________
concatenate_29 (Concatenate)    (None, 7, 9, 1024)   0           instance_normalization_80[0][0]  
                                                                 concatenate_28[0][0]             
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 14, 18, 128)  1179776     concatenate_29[0][0]             
__________________________________________________________________________________________________
instance_normalization_81 (Inst (None, 14, 18, 128)  256         conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
activation_51 (Activation)      (None, 14, 18, 128)  0           instance_normalization_81[0][0]  
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 14, 18, 64)   73792       activation_51[0][0]              
__________________________________________________________________________________________________
instance_normalization_82 (Inst (None, 14, 18, 64)   128         conv2d_transpose_7[0][0]         
__________________________________________________________________________________________________
activation_52 (Activation)      (None, 14, 18, 64)   0           instance_normalization_82[0][0]  
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 14, 18, 6)    24582       activation_52[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 14, 18, 6)    42          conv2d_79[0][0]                  
==================================================================================================
Total params: 6,986,160
Trainable params: 6,986,160
Non-trainable params: 0
__________________________________________________________________________________________________
